Autodesk.Revit.DB.TransientGRepKeeper.AddToGRepKeeperForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TransientGRepKeeper.SetGRepKeeperForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TransientGRepKeeper.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TransientGRepKeeper
Contains native implementations of setting transient element with GRep needed to be viewed in context of the model
Remarks:
Contains native implementations of setting transient element with GRep needed to be viewed in context of the model
The internal API wrappers are called directly by the related public API methods.